title: Whoami Execution
id: 7c746751-3af7-46c2-9c04-6b156ede7a83
status: experimental
description: Detects the execution of whoami in linux operating system, which is often used by attackers after exloitation / privilege escalation but rarely used by root
author: jonitampan
date: 2021/03/05
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        service.type: file_integrity
        file.path: /usr/bin/whoami
        file.mime_type: application/x-executable
    condition: selection
falsepositives:
    - Admin activity
    - Scripts and administrative tools used in the monitored environment
level: medium
